DataProcessors/ОбработкаРаботыСAbills.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаРаботыСAbills</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.vr_ТипКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаАбонплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключенияКБилингу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКБилингу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресRestAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортRestAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПакетаДляПолученияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМетодДляОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СинхронизацияКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Bill_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>COMPANY_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>contract_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>login</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойППКДляОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойППКДляОплатыНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДГПОУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяОрганизация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НайденийВ1сПоГУИДППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сопоставлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Создавать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойППКДляОплат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>method</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Bill_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ext_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>datetime</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>COMPANY_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CONTRACT_ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>__JURIK_1C</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОшибкаОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДГПОУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>describe</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыВыгрузкиППИВAbbils.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВыгрузкиППИВAbbils</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКБилингу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/vr_ТипКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>vr_ТипКомпании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Частный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетнаяОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОбработкаРаботыСAbills/Ext/ObjectModule.bsl
функция ВыгрузитьПлатежкуИзДокументаВБилинг(Документ) Экспорт 
	Ответ = ПриОткрытииНайтиОсновнуюНастройкуПользователя();
	
	Если Ответ = "Не найденна основная настройка для выгрузки в билинг" Тогда 
		Сообщить(Ответ);
		Возврат Ложь;
	КонецЕсли;
	
	Соед = Подключение();
	
	мUID = Документ.Контрагент.ОсновнойППКДляОплат.UID_Билинг;
	Если Соед = Неопределено Тогда
		РезультатТекст = "Не удалось установить соединение с " + АдресRestAPI;
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(мUID) Тогда 
		Сообщить("Не указан UID в ППК");
		Возврат Ложь;

	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Контрагент.ОсновнойППКДляОплат.billId) Тогда 
		Сообщить("Не указан Bill_ID в ППК");
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.UID_Abbils) Тогда 
		Сообщить("Для документа:"+ Документ + " уже выгруженна платежка" +". Платежка выгруженна будет выгружена повторно");
	КонецЕсли;
	
	Метод = ПолучитьНаименованиеМетодаДляДобавлениеОплатыПользователю(мUID);			
	
	СтруктураДокумента = Новый Структура;
	  СтруктураДокумента.Вставить("Сумма",     Документ.СуммаДокумента);
	СтруктураДокумента.Вставить("method" ,   ОсновнойМетодДляОплаты);
	СтруктураДокумента.Вставить("Bill_ID",   Документ.Контрагент.ОсновнойППКДляОплат.billId);
	СтруктураДокумента.Вставить("Ссылка",    Документ);
	СтруктураДокумента.Вставить("describe",  Строка(Документ.Дата));
	

	Результат = СоздатьОплатуВБилинге(Метод,Соед,СтруктураДокумента);
	
	Возврат Результат;
КонецФункции

Функция Подключение() Экспорт

	Адрес = ПолучитьАдрес();

	Попытка
		Соед = Новый HTTPСоединение(Адрес,ПортRestAPI,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить соединение с " + Адрес);
	КонецПопытки;

	Возврат Соед;

КонецФункции

Функция ПолучитьАдрес() Экспорт
	Возврат АдресRestAPI;
КонецФункции

функция ПолучитьНаименованиеМетодаДляПолученияДанныхПоГуид(UID) Экспорт
	Метод = "/api.cgi/users/"+UID+"/pi";
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляПолученияВсехДанныхПоППК() Экспорт
	Метод = "/api.cgi/users/all"+"?pageRows="+РазмерПакетаДляПолученияДанных;
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляДобавлениеОплатыПользователю(UID) Экспорт
	Метод = "/api.cgi/payments/users/"+UID;
	Возврат Метод;
КонецФункции

функция ПолучитьНаименованиеМетодаДляДанныеПользователя_БИЛД_ПоГуид(UID) Экспорт
	Метод = "/api.cgi/users/"+UID;
	Возврат Метод;

КонецФункции

функция СоздатьОплатуВБилинге(Метод,Соед,СтрокаПлатежки) Экспорт
	ПлатажекаСоздана = Ложь;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("KEY", APIKey);
	
	//{
	//"sum": 1.15,
	//"method": 19,
	//"billId": 7475,
	//"describe": "Test payment",
	//"innerDescribe": "this client is pig",
	//"date": "2021-12-01",
	//"exchangeId": 1,
	//"cashboxId": 1,
	//"createReceipt": 1,
	//"applyToInvoice": 1,
	//"extId": "Liqpay:12345"
	//}
	
	СтруктураТовара = Новый Структура;
	СтруктураТовара.Вставить("sum",     СтрокаПлатежки.Сумма);
	СтруктураТовара.Вставить("method"  ,СтрокаПлатежки.method);
	СтруктураТовара.Вставить("billId"  ,СтрокаПлатежки.Bill_ID);
	СтруктураТовара.Вставить("describe",СтрокаПлатежки.describe);

	ЗаписьДжСОН = Новый ЗаписьJSON;
	ЗаписьДжСОН.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДжСОН,СтруктураТовара);	
	ТелоJson = ЗаписьДжСОН.Закрыть();

	ЗапросАПИ = Новый HTTPЗапрос(Метод, Заголовки);
	ЗапросАпи.УстановитьТелоИзСтроки(ТелоJson,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = Соед.ОтправитьДляОбработки(ЗапросАПИ);
	
	//Парсинг
	КодОтвета = Ответ.КодСостояния;
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	//СтрокаОтвета = СтрЗаменить(СтрокаОтвета,""""":","""test"":");
	
	Если КодОтвета = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);      
		Массив = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		ПлатажекаСоздана = Истина;
		paymentId = Массив.paymentId;
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код ответа = "+КодОтвета);
	КонецЕсли;
	
	Если ПлатажекаСоздана Тогда 
		СоздатьЗаписьВРегистреСтатусыВыгрузкиППИВAbbils(СтрокаПлатежки.Ссылка,ПлатажекаСоздана,paymentId);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция СоздатьЗаписьВРегистреСтатусыВыгрузкиППИВAbbils(Документ,ПлатажекаСоздана,UID_Abbils) Экспорт 
	
	Запись = РегистрыСведений.СтатусыВыгрузкиППИВAbbils.СоздатьМенеджерЗаписи();
	Запись.ДатаВыгрузки = ТекущаяДата();
	Запись.Документ = Документ;
	Запись.Настройка = НастройкаПодключенияКБилингу;
	Запись.Отправлено = ПлатажекаСоздана;
	Запись.Записать();
	
	Если ПлатажекаСоздана Тогда 
		Док = Документ.ПолучитьОбъект();
		Док.UID_Abbils = UID_Abbils;
		Док.Записать();		
	КонецЕсли;
КонецФункции

Функция ПриОткрытииНайтиОсновнуюНастройку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияКБилингу.Ссылка,
	|	НастройкиПодключенияКБилингу.Наименование,
	|	НастройкиПодключенияКБилингу.Организация,
	|	НастройкиПодключенияКБилингу.Адрес,
	|	НастройкиПодключенияКБилингу.Логин,
	|	НастройкиПодключенияКБилингу.Пароль,
	|	НастройкиПодключенияКБилингу.ОсновнаяНастройка,
	|	НастройкиПодключенияКБилингу.Актуальная,
	|	НастройкиПодключенияКБилингу.АдресRestAPI,
	|	НастройкиПодключенияКБилингу.ПортRestAPI,
	|	НастройкиПодключенияКБилингу.APIKey,
	|	НастройкиПодключенияКБилингу.РазмерПакетаДляПолученияДанных,
	|	НастройкиПодключенияКБилингу.ОсновнойМетодДляОплаты
	|ИЗ
	|	Справочник.НастройкиПодключенияКБилингу КАК НастройкиПодключенияКБилингу
	|ГДЕ
	|	НастройкиПодключенияКБилингу.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиПодключенияКБилингу.ОсновнаяНастройка = ИСТИНА
	|	И НастройкиПодключенияКБилингу.Актуальная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
		Возврат "Не найденна основная настройка для выгрузки в билинг";
	КонецЕсли;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Логин       = ВыборкаДетальныеЗаписи.Логин;
		Пароль      = ВыборкаДетальныеЗаписи.Пароль;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		Адрес       = ВыборкаДетальныеЗаписи.Адрес;
		НастройкаПодключенияКБилингу = ВыборкаДетальныеЗаписи.Ссылка; 
		
		АдресRestAPI = ВыборкаДетальныеЗаписи.АдресRestAPI;
		ПортRestAPI  = ВыборкаДетальныеЗаписи.ПортRestAPI;
		APIKey       = ВыборкаДетальныеЗаписи.APIKey;
		РазмерПакетаДляПолученияДанных       = ВыборкаДетальныеЗаписи.РазмерПакетаДляПолученияДанных;
		ОсновнойМетодДляОплаты = ВыборкаДетальныеЗаписи.ОсновнойМетодДляОплаты;
		
	КонецЦикла;
		
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	ТипКомпании = ПредопределенноеЗначение("Перечисление.vr_ТипКомпании.БюджетнаяОрганизация");
	
	Возврат Истина;
КонецФункции

Функция ПриОткрытииНайтиОсновнуюНастройкуПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияКБилингу.Ссылка,
	|	НастройкиПодключенияКБилингу.Наименование,
	|	НастройкиПодключенияКБилингу.Организация,
	|	НастройкиПодключенияКБилингу.Адрес,
	|	НастройкиПодключенияКБилингу.Логин,
	|	НастройкиПодключенияКБилингу.Пароль,
	|	НастройкиПодключенияКБилингу.ОсновнаяНастройка,
	|	НастройкиПодключенияКБилингу.Актуальная,
	|	НастройкиПодключенияКБилингу.АдресRestAPI,
	|	НастройкиПодключенияКБилингу.ПортRestAPI,
	|	НастройкиПодключенияКБилингу.APIKey,
	|	НастройкиПодключенияКБилингу.РазмерПакетаДляПолученияДанных,
	|	НастройкиПодключенияКБилингу.ОсновнойМетодДляОплаты
	|ИЗ
	|	Справочник.НастройкиПодключенияКБилингу КАК НастройкиПодключенияКБилингу
	|ГДЕ
	|	НастройкиПодключенияКБилингу.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиПодключенияКБилингу.Ссылка = &Ссылка
	|	И НастройкиПодключенияКБилингу.Актуальная = ИСТИНА";
	
	НастройкаПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОснованаяНастройкаПодключенияAbbils");

	Запрос.УстановитьПараметр("Ссылка",НастройкаПользователя);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
		Возврат "Не найденна основная настройка для выгрузки в билинг";
	КонецЕсли;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Логин       = ВыборкаДетальныеЗаписи.Логин;
		Пароль      = ВыборкаДетальныеЗаписи.Пароль;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		Адрес       = ВыборкаДетальныеЗаписи.Адрес;
		НастройкаПодключенияКБилингу = ВыборкаДетальныеЗаписи.Ссылка; 
		
		АдресRestAPI = ВыборкаДетальныеЗаписи.АдресRestAPI;
		ПортRestAPI  = ВыборкаДетальныеЗаписи.ПортRestAPI;
		APIKey       = ВыборкаДетальныеЗаписи.APIKey;
		РазмерПакетаДляПолученияДанных       = ВыборкаДетальныеЗаписи.РазмерПакетаДляПолученияДанных;
		ОсновнойМетодДляОплаты = ВыборкаДетальныеЗаписи.ОсновнойМетодДляОплаты;
		
	КонецЦикла;
		
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	ТипКомпании = ПредопределенноеЗначение("Перечисление.vr_ТипКомпании.БюджетнаяОрганизация");
	
	Возврат Истина;
КонецФункции
